#	第一部分 原理和初步应用
##  1 合情推理

>当今科学的逻辑讨论的命题要么是确凿无误、要么是完全不可能要么是完全不能确定的，以上所指都无需我们再做更多的推>理。所以，这个世界真正的逻辑是算术逻辑，这部分产生于人类推理头脑中。
>James Clerk Maxwell(1850)

假设某天晚上一名警察走在一个空旷的大街上，突然，他听到入室盗窃的警钟，放眼望去，他发现有个珠宝店的橱窗破了个动。此时，有个带面罩的男人背着个看似装满珠宝的大包正从破窗往外爬。警察毫不犹豫的认为这名男子就是嫌犯。但是，他又是如何得出这样的结论呢？那么，让我们轻松看看此类问题的本质。

###1.1 推理及合情推理
仔细考虑下，我们就发现警察的结论不是一个有效推论；因为对现象可以有各种合理的解释。举例来说，这人可能是珠宝店的老板，刚从酒宴上回到店中，恰巧也没带钥匙。然而，当他经过店铺时，一辆碰巧经过的货车向他的店投掷了一块石块，他仅仅在保护自己的财产。  
    
尽管我们认为警察的推理不是很有逻辑，但是我们认为结论在一定程度上还是令人信服的。我们观察到的现象并不能保证这名男子有罪，但是在很大程度上是可信的。

